#include <iostream>
#include <locale.h>

using namespace std;

int main()
{
    setlocale(LC_ALL, "rus");

    cout << "В строку:" << endl;

    cout << "\t-------------------\n\t|1|\t|2|\t|3|\n\t-------------------\n\t|4|\t|5|\t|6|\n\t-------------------\n\t|7|\t|8|\t|9|\n\t-------------------\n\t|*|\t|0|\t|#|\n\t-------------------\n" << endl;

    cout << "В столбик:" << endl;
    cout << "\t-------------------\n";
    cout << "\t|1|\t|2|\t|3|\n";
    cout << "\t-------------------\n";
    cout << "\t|4|\t|5|\t|6|\n";
    cout << "\t-------------------\n";
    cout << "\t|7|\t|8|\t|9|\n";
    cout << "\t-------------------\n";
    cout << "\t|*|\t|0|\t|#|\n";
    cout << "\t-------------------\n";
    cout << endl;
    cout << "С помощью сырой строки:" << endl;
    cout << R"(        -------------------
        |1|     |2|     |3|
        -------------------
        |4|     |5|     |6|
        -------------------
        |7|     |8|     |9|
        -------------------
        |*|     |0|     |#|
        -------------------
)";
}